In [ ]:
import sqlite3
import datetime as dt

In [ ]:
conn = sqlite3.connect('test.db')

In [ ]:
conn.execute('''CREATE TABLE TRANSACTIONS
         (ID INT NOT NULL,
         INSERT_TIME TIMESTAMP NOT NULL,
         TX_AMOUNT FLOAT,
         TX_TYPE STRING,
         STATUS STRING);''')
#conn.execute("DROP TABLE TRANSACTIONS")

In [ ]:
ids= 2
tx_amount = 7901025;
tx_type = "DOGE";
status = "DONE";

In [ ]:
def insert_data(ids,tx_amount,tx_type,status):
    inserted_time =dt.datetime.now()
    conn.execute("INSERT INTO TRANSACTIONS (ID,INSERT_TIME,TX_AMOUNT,TX_TYPE,STATUS)\
      VALUES(?, ?, ?, ?, ?)",(ids,inserted_time,tx_amount,tx_type,status));
    print("added successfully");
    conn.commit();
insert_data(ids,tx_amount,tx_type,status)

In [ ]:
cursor = conn.execute("SELECT * from TRANSACTIONS")
for x in cursor:
   print("ID = ", x[0]);
   print("insert_time = ", x[1]);
   print("tx_amount = ", x[2]);
   print("tx_type = ", x[3]),
   print("status = ", x[4]);

## Dataset A

1. You are assigned to create a view that only shows the most updated transactions for each id, so there is no duplicate id inside the view.

In [ ]:
cursor = conn.execute("SELECT ID, MAX(INSERT_TIME) AS INSERT_TIME, TX_AMOUNT, TX_TYPE, STATUS \
from TRANSACTIONS GROUP BY ID")
for x in cursor:
   print("ID = ", x[0]);
   print("insert_time = ", x[1]);
   print("tx_amount = ", x[2]);
   print("tx_type = ", x[3]),
   print("status = ", x[4]);

## Dataset B

2. Write a query to get the rolling sum total of sales using the window function!

In [ ]:
conn.execute('''CREATE TABLE SALES
         (SALES_DATE DATE,
         SALES FLOAT);''')
# conn.execute("DROP TABLE SALES")

In [ ]:
conn.execute("INSERT INTO SALES (SALES_DATE,SALES) \
      VALUES \
       ('2021-01-01', 100), \
       ('2021-01-02', 34), \
       ('2021-01-02', 123), \
       ('2021-01-02', 134), \
       ('2021-01-03', 145), \
       ('2021-01-03', 24), \
       ('2021-01-04', 541), \
       ('2021-01-04', 636), \
       ('2021-01-05', 322), \
       ('2021-01-06', 242), \
       ('2021-01-07', 22), \
       ('2021-01-08', 46) \
      ")

In [ ]:
cursor = conn.execute("SELECT SALES_DATE,SALES from SALES")
for x in cursor:
   print("Date = ", x[0]);
   print("Sales = ", x[1]);

In [10]:
cursor = conn.execute("SELECT SALES_DATE,SUM(SALES) \
from SALES GROUP BY SALES_DATE")
for x in cursor:
   print("Date = ", x[0]);
   print("Total sales that day = ", x[1]);

NameError: name 'conn' is not defined

In [11]:
conn.close()

NameError: name 'conn' is not defined

# Dataset C

Your task is to create an automation (python script preferable) that convert JSON file above into three CSV files below

In [38]:
import pandas as pd

In [8]:
datac = [
   {
       "user": {
           "id": 1,
           "name": "agus",
           "email": "agus@example.com"
       },
       "txs": [
           {
               "id": 1,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 3,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "buy"
           },
           {
               "id": 5,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "sell"
           }
       ]
   },
   {
       "user": {
           "id": 2,
           "name": "asep",
           "email": "asep@example.com"
       },
       "txs": [
           {
               "id": 2,
               "tx_date": "2020-01-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 4,
               "tx_date": "2020-02-01",
               "tx_amount": 10,
               "tx_type": "sell"
           },
           {
               "id": 6,
               "tx_date": "2020-03-01",
               "tx_amount": 20,
               "tx_type": "buy"
           }
       ]
   }
]

#### CSV 1 (user_id, tx_id)

In [37]:
user_id = []
tx_id = []

for i in range(0, len(datac)):
    user_temp = datac[i]['user']
    tx_temp = datac[i]['txs']
    for j in range(0,len(tx_temp)):
        user_id.append(list(user_temp.values())[0])
        tx_id.append(tx_temp[j]['id'])


csvone = {'user_id': user_id, 'tx_id' : tx_id}
csvone

{'user_id': [1, 1, 1, 2, 2, 2], 'tx_id': [1, 3, 5, 2, 4, 6]}

In [65]:
convertone = pd.DataFrame(csvone)
convertone.head(6)

   user_id  tx_id
0        1      1
1        1      3
2        1      5
3        2      2
4        2      4
5        2      6

In [ ]:
convertone.to_csv('CSV_01.csv')

#### CSV 2 (ID,name,email)

In [55]:
csvtwo = []

for i in range(0, len(datac)):
    temp = datac[i]['user']
    csvtwo.append(list(temp.values()))

csvtwo

[[1, 'agus', 'agus@example.com'], [2, 'asep', 'asep@example.com']]

In [63]:
converttwo = pd.DataFrame(csvtwo)
converttwo = converttwo.rename(columns = {0: 'ID', 1: 'Name', 2: 'Email'}, inplace = False)
converttwo.head()

   ID  Name             Email
0   1  agus  agus@example.com
1   2  asep  asep@example.com

In [64]:
converttwo.to_csv('CSV_02.csv')

#### CSV 3 (id, tx_date,tx_amount,tx_type)

In [69]:
csvthree = []

for i in range(0, len(datac)):
    temp = datac[i]['txs']
    for j in range(0,len(temp)):
        csvthree.append(temp[j])
        
csvthree

[{'id': 1, 'tx_date': '2020-01-01', 'tx_amount': 10, 'tx_type': 'buy'},
 {'id': 3, 'tx_date': '2020-02-01', 'tx_amount': 10, 'tx_type': 'buy'},
 {'id': 5, 'tx_date': '2020-03-01', 'tx_amount': 20, 'tx_type': 'sell'},
 {'id': 2, 'tx_date': '2020-01-01', 'tx_amount': 10, 'tx_type': 'sell'},
 {'id': 4, 'tx_date': '2020-02-01', 'tx_amount': 10, 'tx_type': 'sell'},
 {'id': 6, 'tx_date': '2020-03-01', 'tx_amount': 20, 'tx_type': 'buy'}]

In [71]:
convertthree = pd.DataFrame(csvthree)
convertthree.head

<bound method NDFrame.head of    id     tx_date  tx_amount tx_type
0   1  2020-01-01         10     buy
1   3  2020-02-01         10     buy
2   5  2020-03-01         20    sell
3   2  2020-01-01         10    sell
4   4  2020-02-01         10    sell
5   6  2020-03-01         20     buy>

In [72]:
convertthree.to_csv('CSV_03.csv')